import Taro from "@tarojs/taro";

export default function Privacy() {
  return (
    <article style={{ padding: 20 }}>
      <title>Privacy Policy 隐私政策</title>
      <h1>Privacy Policy 隐私政策</h1>
      <span>感谢您的使用，本隐私协议适用于我们提供的所有产品和服务，包括但不限于浏览器扩展、App、网站、小程序等。</span>
      <h2>Why we collect data 我们为何会收集信息</h2>
      <span>
        1. 帮助我们不断改进现有产品和服务的质量，保障用户能够更好地使用它们。
<br/><br/>
        2. 使用现有数据库中收集的信息来帮助我们开发新的产品和服务。
<br/><br/>
        3. 帮助提高服务的安全性和可靠性。这包括检测和预防可能会对您或公众造成伤害的欺诈，滥用，安全风险和技术问题。
<br/><br/>
        4. 维护我们的合法利益。比如出于宣传、销售和奖励的需要，我们会在法律允许的情况下收集并处理您的个人信息。
      </span>
      <h2>Information we collect 我们收集的信息包括</h2>
      <span>
        1. 第三方账号的用户支持。

        我们提供的产品目前不支持创建账号，因此当您使用我们的产品及服务时只能通过第三方账号登录。

        为保持我们的数据库更新并为您提供更好的体验，我们可能会根据适用法律收集您提供的信息以及来自第三方的内容，并在合法情况下进行管理和使用。

        这包括：账号及密码；账号信息；登录记录；电子邮件；IP地址等其他第三方提供的用户支持。
<br/><br/>
        2. 您的应用程序、浏览器和设备。

        我们会收集有关您用于访问我们的产品及服务的应用程序，浏览器和设备的信息，这有助于我们提供产品自动更新、增强优化等。

        这包括：浏览器类型和设置；设备类型和设置；操作系统；移动网络信息；产品及服务的版本号。
<br/><br/>
        3. 您在使用我们的产品及服务过程中产生的活动数据。

        通过收集分析您在使用我们的产品及服务过程中的产生活动数据，我们可以更好地了解用户使用情况，以便于做出相应的改善措施。

        这包括：您对我们的产品所进行的自定义设置，比如壁纸、图标等；您储存在产品本地或云端的文本内容，比如待办事项、笔记等；您与我们产品服务的互动信息，比如IP地址、崩溃报告、系统活动、网站和功能的使用频率、您的反馈、您发布的评论等。

        统计该条目内的用户操作数据仅为优化我们的产品和服务，除非经过您的同意，否则我们我们不会披露给任何第三方。
<br/><br/>
        4. 网络浏览器cookie

        您的网络浏览器将cookie放在硬盘上以便记录，有时还可以跟踪有关它们的信息，我们可能会使用“cookies”来增强您的用户体验。

        这包括：会话cookie；永久性cookie；第三方cookie；Flash Cookie等。

        这有助于我们在您将来再次访问网站时记住您的偏好和设置。因此，它们可以增强您的用户体验。

        要使这些cookie生效，它们将存储在您的设备上，并且在浏览器关闭时不会被删除。或者您也可以选择将网络浏览器设置为拒绝cookie，或在发送cookie时提醒您。
      </span>
      <h2>The use of specific reasons 出于特定原因的用途</h2>
      <span>
        我们认为在以下特定情形下，对您的某些信息进行使用披露是合理必要的：
<br/><br/>
        1. 满足任何适用的法律、法规，法律程序或可执行的政府要求。
<br/><br/>
        2. 根据适用的服务条款，对潜在违规行为进行的调查。
<br/><br/>
        3. 检测、防止或以其他方式解决欺诈，安全或技术问题。
<br/><br/>
        4.在法律要求或允许的范围内，防止损害本公司，以及本公司用户或公众的权利，财产或安全。
<br/><br/>
        5. 我们可能会与我们的合作伙伴（如发布商，广告客户，开发商或版权所有者）公开分享非个人身份信息。
      </span>
      <h2>Security assertions 安全声明</h2>
      <span>
        我们仅按现有技术提供相应的安全措施来使我们掌握的信息不丢失、不被滥用和变造。这些安全措施包括向其他服务器备份数据和对用户密码加密。

        尽管有这些安全措施，但我们不保证这些信息的绝对安全。

        由于我们的产品及服务中含有到其他网站的链接，但我们对其他网站的隐私保护措施不负任何责任，并可能在任何需要的时候增加商业伙伴或共用品牌的产品。
      </span>
      <h2>Changes to this policy 本隐私协议的变更</h2>
      <span>
        我们可随时更新本隐私协议。当我们这样做时，我们将修改本页顶部的更新日期。我们建议用户经常查看此页面以便及时了解更改情况。
      </span>
      <h2>Your acceptance of these terms 您接受这些条款</h2>
      <span>
        使用我们的产品及服务即表示您接受本协议。如果您不同意本协议，请不要继续使用。

        您若在本协议变更发布后继续使用，将被视为您接受这些变更，并且同意变更后的协议。
      </span>
      <h2>Governing Laws and Dispute Resolution 法律适用与争议解决</h2>
      <span>
        如果您是中国居民，本协议的效力、解释、履行和争议的解决均适用中华人民共和国法律、法规、电信管理部门的规定和计算机行业的规范。

        如果您是非中国地区的居民，则本协议的效力、解释、履行和争议的解决均适用于您居住地的法律。

        同时我们将采取措施确保您的个人信息得到适当保护，并且只会在法律允许的情况下将您的个人信息转移到这些国家/地区。

        因履行本协议或与本协议有关的一切争议，应通过友好协商方式解决。如果协商未成，则提交本公司住所地有管辖权的人民法院诉讼解决。

        我们与您共同确认：本协议签署的选择权对于双方是完全对等而公允的，即任何一方可以不受强制地选择签署或不签署本协议。本协议是经过双方审慎考虑阐述的意思表示，不存在任何一方片面加大另一方责任或逃避应履行义务的情形。任何一方签署或承诺遵守本协议均视为放弃对于本协议公允性的质疑。
      </span>
      <h2>Contact us 对本隐私协议有任何疑问，请随时与我们联系</h2>
      <span>
        Email(电子邮件)： 3181792315@qq.com。
      </span>
    </article>
  );
}
